Repository: akleemans/custom-sudoku-solver
Catalog: src/locale/messages.*.xlf
Languages: de

source: Solve special-type Sudokus with custom constraints
de: Löse Sudoku-Varianten mit speziellen Bedingungen

source: Enter numbers
de: Zahlen eingeben

source: Add constraints
de: Bedingungen eingeben

source: Enter the numbers which are already known.
de: Gib die schon bekannten Zahlen ein.

source: For a regular Sudoku, click "solve" below, else add contraints by switching to the "Add constraints" view.
de: Um ein normales Sudoku zu kösen, klicke "lösen", ansonsten gib die Bedingungen ein indem du auf die Ansicht "Bedingungen eingeben" wechselst.

source: Solve
de: Lösen

source: Clear
de: Neu

source: Click on cells to select them (INTERPOLATION selected)
de: Klicke auf eine Zelle um sie zu selektieren (INTERPOLATION selektiert)

source: Choose constraint type
de: Bedingungstyp auswählen

source: Odd or even cell(s)
de: Gerade oder ungerade Zelle(n)

source: Two cells: Bigger/smaller than
de: Zwei Zellen: Grösser/kleiner als

source: Two cells: Exact difference
de: Zwei Zellen: Exakte Differenz

source: Two cells: Exact factor
de: Zwei Zellen: Exakter Faktor

source: Multiple cells: Complete unit (1-9)
de: Mehrere Zellen: Komplette Einheit (1-9)

source: Multiple cells: sum
de: Mehrere Zellen: Summe

source: Multiple cells: product
de: Mehrere Zellen: Produkt

source: Choose a constraint type to show its description.
de: Wähle einen Bedingungstyp um seine Beschreibung anzuzeigen.

source: Description:
de: Beschreibung:

source: One or more cells which are odd or even.
de: Eine oder mehrere Zellen die gerade oder ungerade sind.

source: Choose if odd/even:
de: Wähle gerade/ungerade:

source: Even
de: Gerade

source: Odd
de: Ungerade

source: Two cells have a known difference.
de: Zwei Zellen haben eine bekannte Differenz.

source: Enter difference (first cell + difference = second cell):
de: Differenz eingeben (erste Zelle + Differenz = zweite Zelle):

source: Two cells have a known factor.
de: Zwei Zellen haben einen bekannten Faktor.

source: Enter factor (first cell * factor = second cell):
de: Faktor eingeben (erste Zelle * Faktor = zweite Zelle):

source: Second cell is bigger than first one.
de: Zweite Zelle ist grösser als die Erste.

source: Multiple cells must add up to a sum.
de: Mehrere Zellen bilden eine Summe.

source: Enter sum:
de: Summe eingeben:

source: Multiple cells form a product when multiplied.
de: Mehrere Zellen bilden ein Produkt.

source: Enter product:
de: Produkt eingeben:

source: Add
de: Hinzufügen

source: List of Constraints:
de: Liste der Bedingungen:

source: Use standard 3x3 block units
de: Standard 3x3 Einheiten benützen

source: This webapp lets you solve custom Sudokus, and a wide range of known 9x9 Sudoku types:
de: Diese Webapp lässt dich eigene Sudoku-Varianten lösen, darunter auch die folgenden bekannten:

source: Two additional diagonal units
de: Zwei zusätzliche diagonale Einheiten

source: Four additional units
de: Vier zusätzliche Einheiten

source: Killer Sudoku (Sum Sudoku)
de: Killer Sudoku (Summen-Sudoku)

source: Regions of variable size must form sums
de: Regionen von variabler Grösse müssen eine Summe bilden

source: No 3x3 block units, but 9 custom, irregular units instead
de: Keine 3x3 Einheiten, aber dafür 9 irreguläre Einheiten

source: Odd-Even Sudoku
de: Gerade-Ungerade Sudoku

source: Normal Sudoku with odd/even constraints
de: Normales Sudoku mit gerade/ungerade-Bedinungen

source: Greater/Less Than Sudoku
de: Grösser/kleiner-als Sudoku

source: Normal Sudoku with greater/less than constraints
de: Normales Sudoku mit grösser/kleiner-als Bedingungen

source: Custom combinations of the above (for example special Sudokus for Geocaching puzzles)
de: Beliebige Kombinationen der oberen Typen, z.B. für Geocaching-Sudokus.

source: Technical details
de: Technische Details

source: The solver is based on backtracking as described by
de: Der Solver basiert auf Backtracking, beschrieben von

source: It uses custom constraints for propagation and a different heuristic (based on the entered constraints) to optimize the search.
de: Er benützt zusätzlich definierbare Bedingungen zur "propagation" (Ausbreitung) und darauf basierend eine eigene Heuristik zur Auswahl der nächsten zu ratenden Zelle zur Optimierung der Suche.

source: The solving is done inside of a
de: Die Lösungssuche wird ausgeführt in einem

source: The grid is based on the work of
de: Das Sudoku-Gitter basiert auf der Arbeit von

source: The random colors are generated by
de: Zufällige Farben werden generiert mit

source: Page hits:
de: Seitenaufrufe:

source: this month
de: diesen Monat

source: Cells PH must be even
de: Zellen PH sind gerade

source: Cells PH must be odd
de: Zellen PH sind ungerade

source: Cells PH must add up to PH_1
de: Zellen PH ergeben Summe PH_1

source: Cells PH form a unit
de: Zellen PH bilden eine Einheit

source: Cells PH must multiply to PH_1
de: Zellen PH bilden Produkt PH_1

source: Cell PH is bigger than PH_1
de: Zelle PH ist grösser als Zelle PH_1

source: Cells PH have difference of PH_1
de: Zellen PH haben eine Differenz von PH_1

source: Cells PH have factor of PH_1
de: Zellen PH haben einen Faktor von PH_1
